1) Создаем датафреймы

In [30]:
import pandas as pd
import numpy as np

authors = pd.DataFrame ({
        'author_id':[1, 2, 3],
        'author_name':['Тургенев', 'Чехов', 'Островский']})
book = pd.DataFrame ({ 
    'author_id':[1, 1, 1, 2, 2, 3, 3],
    'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                  'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price':[450, 300, 350, 500, 450, 370, 290]
})

2) Создаем датафрейм author_price

In [6]:
author_price = pd.merge(authors, book, on='author_id', how='outer')
author_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

3) top 5

In [7]:
top5 = author_price.nlargest(5, 'price')
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

4) Создаем датафрейм со статистикой цен авторов с помощью аггрегирующей функции agg

In [25]:
author_stat = author_price.groupby(['author_name']).agg({'price':['min', 'max', 'mean']})
author_stat

            price
              min  max        mean
author_name
Островский    290  370  330.000000
Тургенев      300  450  366.666667
Чехов         450  500  475.000000

5) Добавляем столбец cover и делаем сводную таблицу через pd.pivot_table которая считает стоимость книг в мягой и твердой обложках по авторам

In [42]:
author_price.loc[author_price["book_title"].notnull(), 'cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
author_price
book_info = pd.pivot_table(author_price, #исходный датафоейм
               index=['author_name'], #индекс по имени автора
               columns=['cover'], #колонки по типу обложки
               values=['price'], #подсчитываемое значение
               aggfunc=[np.sum],#считаем сумму по значениям
               fill_value=0 #отсутствующие значения заменяем нулями
              )
book_info

               sum
             price
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950

Играемся с pickle

In [52]:
import pickle
with open('book_info.pkl', 'wb') as f:
       pickle.dump(book_info, f)

with open('book_info.pkl', 'rb') as f:
       book_info2 = pickle.load(f)

print(book_info)
print(book_info2)

               sum
             price
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950
               sum
             price
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950